tests/artillery/load-test.yml
config:
  # Sobrescribe este valor en staging con ARTILLERY_TARGET; nunca apuntes a producción.
  target: "http://127.0.0.1:3001"
  environments:
    staging:
      target: "{{ $env.ARTILLERY_TARGET }}"
  phases:
    - duration: 20
      arrivalRate: 1
      name: "Calentamiento"
    - duration: 40
      arrivalRate: 2
      name: "Carga controlada"
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    expect: {}
    ensure:
      thresholds:
        - "http.response_time.p95": 1500

scenarios:
  # Los tokens son de cuentas de prueba dedicadas y se suministran mediante variables de entorno.
  - name: "Consulta autenticada de PQR"
    weight: 40
    flow:
      - get:
          url: "/api/v1/pqr"
          headers:
            Authorization: "Bearer {{ $env.ARTILLERY_ADMIN_TOKEN }}"
          expect:
            - statusCode: 200

  - name: "Radicación controlada de PQR de prueba"
    weight: 60
    flow:
      - post:
          url: "/api/v1/pqr"
          headers:
            Authorization: "Bearer {{ $env.ARTILLERY_CLIENT_TOKEN }}"
          json:
            tipo: "QUEJA"
            titulo: "Carga Artillery {{ $uuid }}"
            descripcion: "PQR creada exclusivamente para verificar capacidad y controles en el entorno de staging."
            conjuntoId: "{{ $env.ARTILLERY_CONJUNTO_ID }}"
            prioridad: "MEDIA"
          expect:
            - statusCode: 201